#include <iostream>
#include <Windows.h>

int main()
{
	//Первый способ подключекния кирилицы
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
	//Второй способ подключекния кирилицы
	//setlocale(LC_ALL, "rus");

	std::cout << "\Hello World!"<<std::endl;
	std::cout << "My name is Masha." << std::endl;
	std::cout << "Escape!\n" << std::endl;
	std::cout << "\"В человеке всё должно быть прекрасно: и лицо, и одежда, и душа, и мысли...\"\nА. П. Чехов\n";
	return 0;
}

// \'   - вивід одинарної лапки(застаріла, уже просто так можна виводити одинарну лапку).
// \?   - оминання триграфів.
// \"   - вивід подвійної лапки. 
// \\   - вивід оберненої риски.
// \a   - проігрування одинарного системного звуку (в сучасних комп'ютерах просто грає звук 
//        системного повідомлення). 
// \b   - переніс курсору на 1 позицію вліво.Ця послідовність являється клавішою backspace.
// \f   - переніс курсору на нову сторінку (використовується в друці). 
// \n   - переніс курсору на наступний рядок. Ця послідовність являється клавішою Enter. 
// \г   - переніс курсору на початок даного рядка. 
// \t   - переніс курсору на наступну горизонтальну табуляцію.Ця послідовність являється 
//        клавішою Tab.
// \v   - переніс курсору на наступну вертикальну табуляцію. (використовується в друці). 
// \0цц - вивід символу по його коду у 8-ковій системі числення (ц цифра) 
// \Хцц - вивід символу по його коду у 16-ковій системі числення (ц цифра) 
// \Uцц - вивід символу по його коду у таблиці кодування Unicode (ц цифра)